 isna, isnull, concat functions

In [7]:
import pandas as pd
import numpy as np
example = {'age':[5, 6, np.nan],'born':[np.nan,'1939-05-27','1940-04-25'],'name':['Alfred', 'Batman', np.nan],'toy':[np.nan, 'Batmobile', 'Joker']}

In [10]:
example_df=pd.DataFrame(example)

In [11]:
example_df.isna()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False   True  False

In [12]:
example_df.isnull()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False   True  False

In [14]:
concat1=pd.DataFrame(['A','B','C','D'])
concat2=pd.DataFrame(['E','F','G','H'])
pd.concat([concat1,concat1],ignore_index=True)

   0
0  A
1  B
2  C
3  D
4  A
5  B
6  C
7  D

# Ten DataFrame Functions

In [39]:
concat1.index[3]

3

In [40]:
example_df.columns:[1]

In [36]:
example_df.dtypes

age     float64
born     object
name     object
toy      object
dtype: object

In [41]:
example_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     2 non-null      float64
 1   born    2 non-null      object
 2   name    2 non-null      object
 3   toy     2 non-null      object
dtypes: float64(1), object(3)
memory usage: 224.0+ bytes

In [48]:
example_df.select_dtypes

<bound method DataFrame.select_dtypes of    age        born    name        toy
0  5.0         NaN  Alfred        NaN
1  6.0  1939-05-27  Batman  Batmobile
2  NaN  1940-04-25     NaN      Joker>

In [ ]:
example_df.v